code/openfoam/tutorials/fluid/concentricCylinders/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   40;
    }
    thermodynamics
    {
        Cp          520;
        hf          0;
    }
    transport
    {
        mu          3.9e-5;
        kappa       0.031;
    }
}

baffle
{
    specie
    {
        molWeight   55;
    }
    transport
    {
        kappa       40;
    }
    thermodynamics
    {
        hf          0;
        Cv          600;
    }
    equationOfState
    {
        rho         7800;
    }
}

// ************************************************************************* //
